#pragma once
/******************************************************************************
*                                 流程控制                                    *
*******************************************************************************/

//为很么使用"强制结束()"而不是"结束()",首先是因为结束宏的定义和其他函数中析构函数中文的成员函数有歧义，其二想让大家尽量减少使用，控制台程序跑完，或者加条件跳出，win sendmessage销毁主线程主窗口
#define 强制结束() exit(0)
#define 到循环尾() continue
#define 跳出循环() break

//从一开始计次，完成所有循环次数;
#define 计次循环首(次数, 变量) for (size_t (变量) = 1; 变量 <= (次数); 变量++)


#define 判断循环首(逻辑条件) while(逻辑条件)
#define 判断循环尾() do

#define 循环判断首() do
#define 循环判断尾(逻辑条件) while(逻辑条件)

#define 如果(逻辑条件) if(逻辑条件)
#define 否则 else
#define 如果真(逻辑条件) if(逻辑条件)
#define 返回  return 

#define 判断(逻辑条件) if(逻辑条件)
#define 变量循环首(变量起始值,变量目标值,变量递增值,循环变量)  for ((循环变量) = (变量起始值); 循环变量 <= (变量目标值); 循环变量=循环变量+(变量递增值))
